In [1]:
import pandas as pd

# Setting & Resetting Index

`.set_index()` and `.reset_index()`

In [2]:
df = pd.DataFrame({
    "ID": [101, 102, 103, 104],
    "Name": ["Onkar", "Amit", "Sara", "Rohit"],
    "City": ["Pune", "Mumbai", "Nashik", "Pune"],
    "Salary": [50000, 65000, 55000, 70000]
})

df

    ID   Name    City  Salary
0  101  Onkar    Pune   50000
1  102   Amit  Mumbai   65000
2  103   Sara  Nashik   55000
3  104  Rohit    Pune   70000

Right now above table have default index which is (0,1,2,....)

## 1. What is an index?

index = row labels. Used to identify the rows.  
It can be number, string, date, IDs, etc.  
It is like primary key of the table.

## 2. `.set_index()` -> Change a column into a index

In [11]:
# access by default index
df.loc[1]

ID           102
Name        Amit
City      Mumbai
Salary     65000
Name: 1, dtype: object

In [12]:
df_indexed = df.set_index("ID") # Set ID column as index
df_indexed

      Name    City  Salary
ID
101  Onkar    Pune   50000
102   Amit  Mumbai   65000
103   Sara  Nashik   55000
104  Rohit    Pune   70000

In [13]:
df_indexed.loc[101] # access rows by using ID. As we set IDcolumn as index

Name      Onkar
City       Pune
Salary    50000
Name: 101, dtype: object

In [14]:
# But when setting the index the column is droped from data if you want column stay in the data so doo
df.set_index("ID", drop=False)

      ID   Name    City  Salary
ID
101  101  Onkar    Pune   50000
102  102   Amit  Mumbai   65000
103  103   Sara  Nashik   55000
104  104  Rohit    Pune   70000

Points:  
1. `.set_index("col_name")` -> to set the column as index (but the column drops from the data)  
Too keep it do
2. `.set_index("col_name", drop=False)`

## 3. `.reset_index()` -> Resets the index to default

In [15]:
df_indexed.reset_index()

    ID   Name    City  Salary
0  101  Onkar    Pune   50000
1  102   Amit  Mumbai   65000
2  103   Sara  Nashik   55000
3  104  Rohit    Pune   70000

In [16]:
df_indexed.reset_index(drop="True")

    Name    City  Salary
0  Onkar    Pune   50000
1   Amit  Mumbai   65000
2   Sara  Nashik   55000
3  Rohit    Pune   70000

Points:  
1. `.reset_index()` -> It reset the index to default only.
2. `.reset_index(drop=True)` -> It drops the column which is index.

## 4. When should you set an index?

When a column uniquely determines the rows

## 4. When should you set an index?

After filtering rows and before exporting data